// pages/intriduce/intriduce.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
  nextMsg:"万里长征人不还",
  imgPath: "../../images/1.jpg",
  pathList:[
    {
      name: "图片1",
      imgPath: "../../images/4.jpg",
      desc: "鲁朱家者，与高祖同时。鲁人皆以儒教，而朱家用侠闻。所藏活豪士以百数， 其馀庸人不可胜言。然终不伐其            能，歆其德，诸所尝施，唯恐见之。振人不赡，先从贫贱始。家无馀财，衣不完采，食不重味，乘不过軥牛。专趋人之急，甚己之私。既阴脱季布将军之阸，及布尊贵，终身不见也。自关以东，莫不延颈愿交焉。 楚田仲以侠闻，喜剑，父事朱家，自以为行弗及"
    },
    {
      name: "图片2",
      imgPath: "../../images/5.jpg",
      desc: "周勃是沛县人，祖籍卷县，是汉高祖刘邦的同乡（同为沛县人）。周勃以编织养蚕的器具为生，经常为有丧事的人家做吹鼓手，后来又做了拉强弓的勇士。周勃出身贫苦，定居沛县后，因距邑城较近，故青年时期以芦苇编织苇箔、蚕具营生，间或为人婚丧嫁娶之时充当吹鼓手维持生计。但他自幼习武，弓马娴熟，孔武有力。“周勃，以材官（训练步兵的低级武宫）从高祖，战功居多。高后时，勃与陈平议诛诸吕，迎代王即位，封绛候。就国卒，谥武侯。"
    },
    {
      name: "图片3",
      imgPath: "../../images/6.jpg",
      desc: "　司马卬是战国时期赵国著名剑客司马蒯聩的玄孙（一作曾孙）。 秦朝末年，司马卬曾担任武信君武臣的部将，率军攻占朝歌（今河南淇县）。"
    },
    {
      name: "图片4",
      imgPath: "../../images/7.jpg",
      desc: "　芈姝是楚威后所生的嫡女，后为秦惠文王后，芈月同父异母的姐姐，也是芈月从小到大的对手和情敌。她曾经是芈月所羡慕的对象，因为她有无忧无虑的生活和宠爱备至的母亲，这些都是芈月所没有的。"
    },
    {
      name: "图片5",
      imgPath: "../../images/8.jpg",
      desc: "玛丽亚·斯克沃多夫斯卡·居里(1867~1934)， 原籍波兰，法国著名科学家、物理学家、化学家。1867年11月7日生于波兰首都华沙，1891年随姐姐布洛尼斯拉娃至巴黎读书。在巴黎取得学位并从事科学研究，为巴黎和华沙“居里研究所”的创始人。"
    },
    {
      name: "图片6",
      imgPath: "../../images/9.jpg",
      desc: "拿破仑·波拿巴（法文：NapoléonBonaparte，1769年~1821年），出生于法国的科西嘉岛，是一位世界著名的军事家、政治家。他是法兰西第一共和国执政官，是十九世纪最著名的法兰西第一帝国的缔造者，于1804年11月6日加冕称帝。"
    },
    {
      name: "图片10",
      imgPath: "../../images/10.jpg",
      desc: "耶律燕是金庸武侠小说《神雕侠侣》中的人物。她是蒙古官员耶律楚材的女儿、耶律齐的妹妹。她性格豪爽和气，最后成为了武敦儒的妻子。"
    },

    // {
    //   name:"图片1",
    //   imgPath:"../../images/1.jpg",
    //   desc:"瀚海阑干百丈冰，三首古诗看尽千城雪"
    // },
    // {
    //   name: "图片2",
    //   imgPath: "../../images/2.jpg",
    //   desc: ""
    // },
    // {
    //   name: "图片3",
    //   imgPath: "../../images/timg.jpeg",
    //   desc: ""
    // },
  ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})